defmodule Wheather do

  "api.openweathermap.org/data/2.5/weather?q=Varna,bg&APPID=560f162e63d59f7a32a22a0d9f57c78a&units=metric"


  да се направят 2 джен сървъра, първият парви заявки към апито за замърсяване на въздуха
  другият към апито на оупън уедър
    заявките да се извършват през 1 минута


  ако въздухът е много мръсен да се вика функция която да затваря прозорците ако въздуха е мръсен, съответно ако са затворени да каже че вече са затворени и няма нужда да бъдат затваряни

  за оупън уедър - ако времето е слънчево да показва "соларните панели са активирани", ако температурата е над 30 градуса ад се пуска вентилатор в стаята,
  ако въздухът е много влажен и прозорците са отворени! да се пуска влаго абсорбатор, ако прозорците се затворят влагата да намаля и при стойност под 20 влагоабсорбаторът да се спира
  да се провери градусът на вятъра и да се покаже като информация "вятарът идва от  <посока>" и по скалата на бютфорт е
  "https://en.wikipedia.org/wiki/Beaufort_scale" - скла на бютфорт за скоростта на вятъра
  "http://snowfence.umn.edu/Components/winddirectionanddegreeswithouttable3.htm" - за вятъра градусите


  трети джен сървър имплементиращ хладилник, да се отваря затваря, да се добавят продукти да се консумират продукти,
  да се дефинира списък с основни продукти, които ако ги няма като бройка да се изкарва нотификейшън
  след определено време да се развалят продуктите и автоматично да се махат от хладилника
  различните видове продукти да се развалят за различмно време


  градина дженсървър, да се добави timex библиотеката, да се пускат пръскачки за поливане и да се спират с timex да се
   проверява какво е local времето и ако е между 10 сутринта и 7 селдобяд да не може да се пускат пръскачките, да се взима
    от дженсървъра за времето дали вали и ако вали пръскачките да не се пускат, ако завали пръскачките да се спират
  @garden %{
    "garden1" => {["apple, organe, grape"], 22, very_good/ good/ bad/ very_bad/rotten}
    "garden2" => %{"grape" => 20, "more grape" => 20}

  }
  ученика трябав да засее растения в две градини
  ученика  да избере в коя градина какво растение ще се сее
  ако една градина е много суха и растенията не могат да се развият започва процес на разваляне,
  състоянието на градината да се променя на десет минута ако е ниска влажността за 40 минути да стане от very good to rotten
  да се изкарват съобщения когато статуса на някоя градина се промени

  Всяка градина да си има отделна пръскачка

  !!!! за даскала !!!! напарви таблица с растения и горна и долна граница на влажността за всяко от тях

  всички дженсървъри да се стартират автоматично през супервайзор ако един спре да се рестартира, другите да продължават да си работят
  да се имплементират функции които нарочно да чупят сървърите за да се тества рестартирането


  бонус да се използва база данни Ecto postgress да се имплементират функции за добавяне и вземане на данни от базата
end


